import jieba

sentence = "古明地觉来自于东方地灵殿,是一个超级可爱的女孩"
print(jieba.lcut(sentence))  # ['古明', '地觉', '来自', '于', '东方', '地灵', '殿', ',', '是', '一个', '超级', '可爱', '的', '女孩']

# 通过add_word的方式同样可以添加我们自己定义的词语
jieba.add_word("古明地觉")
jieba.add_word("东方地灵殿")
print(jieba.lcut(sentence))  # ['古明地觉', '来自', '于', '东方地灵殿', ',', '是', '一个', '超级', '可爱', '的', '女孩']

# 当然也可以动态参数
jieba.del_word("东方地灵殿")
print(jieba.lcut(sentence))  # ['古明地觉', '来自', '于', '东方', '地灵', '殿', ',', '是', '一个', '超级', '可爱', '的', '女孩']
# 可以看到，在删除'东方地灵殿'之后，又分的不准了